// ========================
// HP
// ========================
max_hp = 2;
hp = max_hp;


// ========================
// 상태
// ========================
state = "idle";


// ========================
// 플레이어 감지
// ========================
detect_range = 180;


// ========================
// 차징
// ========================
charge_timer = 0;
charge_time = 45;


// ========================
// 돌진
// ========================
dash_speed = 7;
dash_timer = 0;
dash_time = 20;

dash_x = 0;
dash_y = 0;


// ========================
// 공격 후 쿨다운
// ========================
cooldown_timer = 0;
cooldown_time = 90;

// ========================
// 피격 효과
// ========================
hit_flash_timer = 0;

// ========================
// 피격 넉백
// ========================

knockback_x = 0;
knockback_y = 0;

knockback_timer = 0;
knockback_speed = 4;

// ========================
// 연속 돌진
// ========================

dash_count = 0;
max_dash_count = 1;

redash_timer = 0;
redash_time = 15;

// ========================
// 낮 / 밤 광폭화
// ========================

is_enraged = false;
is_transforming = false;

// 현재 낮/밤 상태 기억
last_is_day = true;


