// =====================================================
// PLAYER CREATE - TEONIA
// =====================================================

// 체력 및 능력치
max_hp = 5;
hp = max_hp;

attack_damage = 1;
defense = 0;
move_speed = 4;
potion_heal = 2;

// 이동 방향
facing = "down";

// 기본 애니메이션
sprite_index = spr_player_idle;
image_index = 0;
image_speed = 0.15;

// =====================================================
// 공격 - 8타 콤보
// =====================================================

is_attacking = false;
attack_timer = 0;

combo_step = 0;
combo_queued = false;
combo_speed = 0.25;
combo_hit_mask = 0;

// =====================================================
// 구르기
// =====================================================

is_rolling = false;
roll_timer = 0;
roll_speed = 8;
roll_x = 0;
roll_y = 0;

is_invincible = false;

// =====================================================
// 피격 애니메이션
// =====================================================

is_hit = false;
hit_timer = 0;
hit_duration = 12;
last_hp = hp;

// =====================================================
// 사망
// =====================================================

is_dead = false;

// =====================================================
// 대화
// =====================================================

dialogue_open = false;
dialogue_text = "";

// =====================================================
// 아이템 및 인벤토리
// =====================================================

slime_gel = 0;
health_potion = 3;
inventory_open = false;
gold = 0;

// =====================================================
// 상인 업그레이드
// =====================================================

upgrade_open = false;
upgrade_cost = 50;

card1 = -1;
card2 = -1;
card3 = -1;

// =====================================================
// 피격 넉백
// =====================================================

knockback_x = 0;
knockback_y = 0;
knockback_timer = 0;
knockback_speed = 6;

// =====================================================
// 세이브 포인트
// =====================================================

save_x = x;
save_y = y;
has_save_point = false;

// =====================================
// 포션 힐 애니메이션
// =====================================
is_drinking_potion = false;
potion_timer = 0;
potion_time = 16;

heal_animation_speed = 0.25;