// ========================
// 기본 스탯
// ========================

max_hp = 5;
hp = max_hp;

attack_damage = 1;
defense = 0;

move_speed = 4;
potion_heal = 2;


// ========================
// 방향
// ========================

facing = "down";


// ========================
// 공격
// ========================

is_attacking = false;
attack_timer = 0;


// ========================
// 구르기
// ========================

is_rolling = false;
roll_timer = 0;
roll_speed = 8;

roll_x = 0;
roll_y = 0;


// ========================
// 무적
// ========================

is_invincible = false;


// ========================
// 사망
// ========================

is_dead = false;


// ========================
// NPC / 상점
// ========================

dialogue_open = false;
dialogue_text = "";


// ========================
// 인벤토리
// ========================

slime_gel = 0;
health_potion = 3;


// ========================
// 돈
// ========================

gold = 0;


// ========================
// 랜덤 강화 카드
// ========================

upgrade_open = false;

upgrade_cost = 50;

card1 = -1;
card2 = -1;
card3 = -1;

// ========================
// 넉백
// ========================

knockback_x = 0;
knockback_y = 0;

knockback_timer = 0;
knockback_speed = 6;

// ========================
// 인벤토리
// ========================

inventory_open = false;

// ========================
// 세이브 포인트
// ========================

// 처음에는 플레이어 시작 위치
save_x = x;
save_y = y;

// 세이브 포인트를 사용했는지
has_save_point = false;

// ========================
// 세이브 포인트
// ========================

// 처음에는 플레이어 시작 위치
save_x = x;
save_y = y;

// 세이브 포인트를 사용했는지
has_save_point = false;

// ========================
// 포션 사용 모션
// ========================

is_drinking_potion = false;
potion_timer = 0;
potion_time = round(room_speed * 0.4);